# LPenFore

## Description
Procedure LPenFore sets the foreground pen color for the active layer. RGB values are in the range of 0~65535.

```pascal
PROCEDURE LPenFore(color : LONGINT);
```

```python
def vs.LPenFore(color):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|color|LONGINT|RGB color component value.|

## Remarks
Sets the foreground pen color for the active layer.

[sd 8/14/98]

## Examples
```pascal
LPenFore(1);
```
```python
import vs

# Procedure LPenFore sets the foreground pen color for the active layer.
color = 5

vs.LPenFore(color)
```

## Version
Availability: from All Versions

## Category
* Layers